Revit 2027 API
FileSaveDialog Constructor
 Constructs a new instance of a File Save dialog.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public FileSaveDialog(
	string filter
)
Public Sub New (
	filter As String
)
public:
FileSaveDialog(
	String^ filter
)
new :
        filter : string -> FileSaveDialog
Parameters
filter String
 The filter string. See the remarks for Filter for details.
Exceptions
Exception | Condition
ArgumentException |  The input filter string does not meet the minimal requirements for a valid filter string.
ArgumentNullException |  A non-optional argument was null
See Also
Reference
FileSaveDialog Class
Autodesk.Revit.UI Namespace